#### –î–º–∏—Ç—Ä–∏–π, –ø—Ä–∏–≤–µ—Ç! 

–ú–µ–Ω—è –∑–æ–≤—É—Ç –ú–∞–∫—Å–∏–º –ü–æ–ø–æ–≤, –∏ —è –±—É–¥—É –ø—Ä–æ–≤–µ—Ä—è—Ç—å —Ç–≤–æ–π –ø—Ä–æ–µ–∫—Ç. –î–∞–≤–∞–π –±—É–¥–µ–º –æ–±—â–∞—Ç—å—Å—è –Ω–∞ ¬´—Ç—ã¬ª. –ù–æ –µ—Å–ª–∏ —Ç–µ–±–µ –∫–æ–º—Ñ–æ—Ä—Ç–Ω–µ–µ –Ω–∞ ¬´–≤—ã¬ª, –æ–±—è–∑–∞—Ç–µ–ª—å–Ω–æ —Å–æ–æ–±—â–∏ –º–Ω–µ –æ–± —ç—Ç–æ–º. 
–ü–æ —Ö–æ–¥—É —Ç–µ—Ç—Ä–∞–¥–∫–∏ —Ç—ã –Ω–∞–π–¥–µ—à—å –∫–æ–º–º–µ–Ω—Ç–∞—Ä–∏–∏ –∫ –ø—Ä–æ–µ–∫—Ç—É, –æ–Ω–∏ –±—É–¥—É—Ç –≤ –æ—Ç–¥–µ–ª—å–Ω—ã—Ö —è—á–µ–π–∫–∞—Ö Markdown —Å –∑–∞–≥–æ–ª–æ–≤–∫–æ–º ¬´–ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π —Ä–µ–≤—å—é–µ—Ä–∞¬ª. –ü–æ—Å—Ç–∞—Ä–∞–π—Å—è —É—á–µ—Å—Ç—å —ç—Ç–∏ –∫–æ–º–º–µ–Ω—Ç–∞—Ä–∏–∏ –¥–ª—è –¥–∞–ª—å–Ω–µ–π—à–∏—Ö –ø—Ä–æ–µ–∫—Ç–æ–≤.

---

–Ø –±—É–¥—É –æ—Ç–º–µ—á–∞—Ç—å –∫–æ–º–º–µ–Ω—Ç–∞—Ä–∏–∏ —Ü–≤–µ—Ç–æ–º –∏ –ø—Ä–∏–º–µ—á–∞–Ω–∏–µ–º. –í –∫–æ–Ω—Ü–µ –∑–∞–≥–æ–ª–æ–≤–∫–∞ –∫–æ–º–º–µ–Ω—Ç–∞—Ä–∏—è –±—É–¥–µ—Ç —É–∫–∞–∑–∞–Ω –Ω–æ–º–µ—Ä –∏—Ç–µ—Ä–∞—Ü–∏–∏ –ø—Ä–æ–≤–µ—Ä–∫–∏. –ü–æ–∂–∞–ª—É–π—Å—Ç–∞, –Ω–µ —É–¥–∞–ª—è–π –∏ –Ω–µ –ø—Ä–∞–≤—å –º–æ–∏ –∫–æ–º–º–µ–Ω—Ç–∞—Ä–∏–∏

–ö—Ä–∏—Ç–∏—á–Ω–æ - —Ç—Ä–µ–±—É–µ—Ç –∏—Å–ø—Ä–∞–≤–ª–µ–Ω–∏—è, –≤–ª–∏—è–µ—Ç –Ω–∞ —É–¥–∞—á–Ω–æ–µ –≤—ã–ø–æ–ª–Ω–µ–Ω–∏–µ –ø—Ä–æ–µ–∫—Ç–∞

–†–µ–∫–æ–º–µ–Ω–¥–∞—Ü–∏—è - –∫–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π —è–≤–ª—è–µ—Ç—Å—è —Ä–µ–∫–æ–º–µ–Ω–¥–∞—Ü–∏–µ–π –∏–ª–∏ —Å–æ–≤–µ—Ç–æ–º. M–æ–∂–µ—à—å —É—á–µ—Å—Ç—å –∏—Ö –ø—Ä–∏ –≤—ã–ø–æ–ª–Ω–µ–Ω–∏–∏ –±—É–¥—É—â–∏—Ö –∑–∞–¥–∞–Ω–∏–π. –ù–∞ —Ç–≤–æ–µ —É—Å–º–æ—Ç—Ä–µ–Ω–∏–µ

–û—Ç–ª–∏—á–Ω–æ - –¢–∞–∫ –æ—Ç–º–µ—á–µ–Ω—ã —É–¥–∞—á–Ω—ã–µ —Ä–µ—à–µ–Ω–∏—è –∏ –ø–æ–¥—Ö–æ–¥—ã, –Ω–∞ –∫–æ—Ç–æ—Ä—ã–µ —Å—Ç–æ–∏—Ç –æ–ø–∏—Ä–∞—Ç—å—Å—è –≤ –±—É–¥—É—â–∏—Ö –ø—Ä–æ–µ–∫—Ç–∞—Ö


---
<div class="alert alert-block alert-danger">
    

### –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π –æ—Ç —Ä–µ–≤—å—é–µ—Ä–∞
–ö—Ä–∏—Ç–∏—á–Ω–æ

–¢–∞–∫–æ–π –∫–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π –Ω—É–∂–Ω–æ –∏—Å–ø—Ä–∞–≤–∏—Ç—å –æ–±—è–∑–∞—Ç–µ–ª—å–Ω–æ, –æ–Ω –∫—Ä–∏—Ç–∏—á–µ—Å–∫–∏ –≤–ª–∏—è–µ—Ç –Ω–∞ —É–¥–∞—á–Ω–æ–µ –≤—ã–ø–æ–ª–Ω–µ–Ω–∏–µ –ø—Ä–æ–µ–∫—Ç–∞.
</div>
    
---

<div class="alert alert-block alert-warning">
    

### –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π –æ—Ç —Ä–µ–≤—å—é–µ—Ä–∞
–†–µ–∫–æ–º–µ–Ω–¥–∞—Ü–∏—è

–¢–∞–∫–æ–π –∫–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π —è–≤–ª—è–µ—Ç—Å—è —Ä–µ–∫–æ–º–µ–Ω–¥–∞—Ü–∏–µ–π –∏–ª–∏ —Å–æ–≤–µ—Ç–æ–º. M–æ–∂–µ—à—å —É—á–µ—Å—Ç—å –∏—Ö –ø—Ä–∏ –≤—ã–ø–æ–ª–Ω–µ–Ω–∏–∏ –±—É–¥—É—â–∏—Ö –∑–∞–¥–∞–Ω–∏–π. –ù–∞ —Ç–≤–æ–µ —É—Å–º–æ—Ç—Ä–µ–Ω–∏–µ. 
</div>

---

<div class="alert alert-block alert-success">
    

### –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π –æ—Ç —Ä–µ–≤—å—é–µ—Ä–∞
–û—Ç–ª–∏—á–Ω–æ
    
–¢–∞–∫ –æ—Ç–º–µ—á–µ–Ω—ã —É–¥–∞—á–Ω—ã–µ —Ä–µ—à–µ–Ω–∏—è –∏ –ø–æ–¥—Ö–æ–¥—ã, –Ω–∞ –∫–æ—Ç–æ—Ä—ã–µ —Å—Ç–æ–∏—Ç –æ–ø–∏—Ä–∞—Ç—å—Å—è –≤ –±—É–¥—É—â–∏—Ö –ø—Ä–æ–µ–∫—Ç–∞—Ö
</div>


–ñ–µ–ª–∞—Ç–µ–ª—å–Ω–æ —Ä–µ–∞–≥–∏—Ä–æ–≤–∞—Ç—å –Ω–∞ –∫–æ–º–º–µ–Ω—Ç–∞—Ä–∏–∏ ('–∏—Å–ø—Ä–∞–≤–ª–µ–Ω–æ', '–Ω–µ –ø–æ–Ω—è—Ç–Ω–æ –∫–∞–∫ –∏—Å–ø—Ä–∞–≤–∏—Ç—å –æ—à–∏–±–∫—É' –∏ —Ç.–ø.) - —Ç–∞–∫ –º—ã —Å–º–æ–∂–µ–º –±–æ–ª–µ–µ —ç—Ñ—Ñ–µ–∫—Ç–∏–≤–Ω–æ –ø–æ—Ä–∞–±–æ—Ç–∞—Ç—å –Ω–∞–¥ —ç—Ç–∏–º –ø—Ä–æ–µ–∫—Ç–æ–º.

---

–ë—É–¥–µ—Ç –∑–¥–æ—Ä–æ–≤–æ, –µ—Å–ª–∏ —Ç—ã –±—É–¥–µ—à—å –ø–æ–º–µ—á–∞—Ç—å —Å–≤–æ–∏ –¥–µ–π—Å—Ç–≤–∏—è —Å–ª–µ–¥—É—é—â–∏–º –æ–±—Ä–∞–∑–æ–º:



<div class="alert alert-block alert-info">

### –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π —Å—Ç—É–¥–µ–Ω—Ç–∞:

</div>

<div class="alert alert-block alert-success">
    

### –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π –æ—Ç —Ä–µ–≤—å—é–µ—Ä–∞

–î–º–∏—Ç—Ä–∏–π, —Ç—ã –±–ª–µ—Å—Ç—è—â–µ —Ä–∞–∑–±–∏—Ä–∞–µ—à—å—Å—è —Å –∑–∞–ø—Ä–æ—Å–∞–º–∏, 5 –∏–∑ 5 —Å –ø–µ—Ä–≤–æ–≥–æ —Ä–∞–∑–∞ üëçüèª .
    
–û–±—Ä–∞—â—É –≤–Ω–∏–º–∞–Ω–∏–µ –Ω–∞ —Å–ª–µ–¥—É—é—â–∏–µ –º–æ–º–µ–Ω—Ç—ã:
    
- –û—Å—Ç–∞–≤–ª—è–π –∫–æ–º–º–µ–Ω—Ç–∞—Ä–∏–∏ –Ω–∞ –ø–æ–¥–∑–∞–ø—Ä–æ—Å—ã, —Ç–∞–∫–∞—è –ø—Ä–∏–≤—ã—á–∫–∞ –ø–æ–º–æ–∂–µ—Ç —Ç–µ–±–µ, –∫–æ–≥–¥–∞ –ø—Ä–∏–¥–µ—Ç—Å—è –≤–æ–∑–≤—Ä–∞—â–∞—Ç—å—Å—è –∫ —Å—Ç–∞—Ä–æ–º—É –∫–æ–¥—É
    
- –ü–æ–ø—Ä–æ–±—É–π –∑–∞–≤–æ—Ä–∞—á–∏–≤–∞—Ç—å –ø–æ–¥–∑–∞–ø—Ä–æ—Å—ã –≤ CTE. –¢–∞–∫ –Ω–∞–º–Ω–æ–≥–æ –ø—Ä–æ—â–µ –∏ —á–∏—Ç–∞—Ç—å, –∏ –ø–∏—Å–∞—Ç—å –∫–æ–¥.

–ï—Å–ª–∏ —É —Ç–µ–±—è –ø–æ–∫–∞ –Ω–µ–±–æ–ª—å—à–æ–π –æ–ø—ã—Ç —Ä–∞–±–æ—Ç—ã —Å SQL, –¥–ª—è –¥–∞–ª—å–Ω–µ–π—à–µ–≥–æ –∏–∑—É—á–µ–Ω–∏—è —Ä–µ–∫–æ–º–µ–Ω–¥—É—é —Å–ª–µ–¥—É—é—â–∏–µ —Ä–µ—Å—É—Ä—Å—ã:
    
1. https://datalearn.ru/kurs-po-sql 
    
–°—Ä–∞–∑—É –ø–µ—Ä–µ—Ö–æ–¥–∏ –∫ –æ–∫–æ–Ω–∫–∞–º –∏ MS SQL Server, —Ç–∞–º –º–Ω–æ–≥–æ –ø–æ–ª–µ–∑–Ω–æ–π –∏–Ω—Ñ—ã –±—É–¥–µ—Ç —É–∂–µ –ø—Ä–æ —Å–æ–∑–¥–∞–Ω–∏–µ —Ç–∞–±–ª–∏—Ü, —Ö—Ä–∞–Ω–∏–º—ã–µ –ø—Ä–æ—Ü–µ–¥—É—Ä—ã –∏ —Ç. –ø. 
    
2. https://stepik.org/course/3203/promo (—ç—Ç–æ —É–∂–µ –µ—Å–ª–∏ —Ö–æ—á–µ—Ç—Å—è –∏–∑—É—á–∏—Ç—å –ø–æ–≥–ª—É–±–∂–µ)
    
–£—Å–ø–µ—Ö–∞ –≤ –ø–æ–∏—Å–∫–µ —Ä–∞–±–æ—Ç—ã!
            
</div>

### –í–≤–µ–¥–µ–Ω–∏–µ

–¶–µ–ª—å –∏—Å—Å–ª–µ–¥–æ–≤–∞–Ω–∏—è: –ø—Ä–æ–∞–Ω–∞–ª–∏–∑–∏—Ä–æ–≤–∞—Ç—å –±–∞–∑—É –¥–∞–Ω–Ω—ã—Ö —Å–µ—Ä–≤–∏—Å–∞ –¥–ª—è —á—Ç–µ–Ω–∏—è –∫–Ω–∏–≥. –†–µ—à–∏—Ç—å –∑–∞–¥–∞—á–∏ –∏ —Å–¥–µ–ª–∞—Ç—å –≤—ã–≤–æ–¥—ã –ø–æ –∫–∞–∂–¥–æ–º—É –ø—É–Ω–∫—Ç—É

### –û–ø–∏—Å–∞–Ω–∏–µ –¥–∞–Ω–Ω—ã—Ö

**–¢–∞–±–ª–∏—Ü–∞ `books`**

–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ –∫–Ω–∏–≥–∞—Ö:

- `book_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∫–Ω–∏–≥–∏;
- `author_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∞–≤—Ç–æ—Ä–∞;
- `title` ‚Äî –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–Ω–∏–≥–∏;
- `num_pages` ‚Äî –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —Å—Ç—Ä–∞–Ω–∏—Ü;
- `publication_date` ‚Äî –¥–∞—Ç–∞ –ø—É–±–ª–∏–∫–∞—Ü–∏–∏ –∫–Ω–∏–≥–∏;
- `publisher_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∏–∑–¥–∞—Ç–µ–ª—è.

**–¢–∞–±–ª–∏—Ü–∞ `authors`**

–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ–± –∞–≤—Ç–æ—Ä–∞—Ö:

- `author_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∞–≤—Ç–æ—Ä–∞;
- `author` ‚Äî –∏–º—è –∞–≤—Ç–æ—Ä–∞.

**–¢–∞–±–ª–∏—Ü–∞ `publishers`**

–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ–± –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞—Ö:

- `publisher_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞;
- `publisher` ‚Äî –Ω–∞–∑–≤–∞–Ω–∏–µ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞;

**–¢–∞–±–ª–∏—Ü–∞ `ratings`**

–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—å—Å–∫–∏—Ö –æ—Ü–µ–Ω–∫–∞—Ö –∫–Ω–∏–≥:

- `rating_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –æ—Ü–µ–Ω–∫–∏;
- `book_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∫–Ω–∏–≥–∏;
- `username` ‚Äî –∏–º—è –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è, –æ—Å—Ç–∞–≤–∏–≤—à–µ–≥–æ –æ—Ü–µ–Ω–∫—É;
- `rating` ‚Äî –æ—Ü–µ–Ω–∫–∞ –∫–Ω–∏–≥–∏.

**–¢–∞–±–ª–∏—Ü–∞ `reviews`**

–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—å—Å–∫–∏—Ö –æ–±–∑–æ—Ä–∞—Ö –Ω–∞ –∫–Ω–∏–≥–∏:

- `review_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –æ–±–∑–æ—Ä–∞;
- `book_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∫–Ω–∏–≥–∏;
- `username` ‚Äî –∏–º—è –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è, –Ω–∞–ø–∏—Å–∞–≤—à–µ–≥–æ –æ–±–∑–æ—Ä;
- `text` ‚Äî —Ç–µ–∫—Å—Ç –æ–±–∑–æ—Ä–∞.

In [1]:
# –∏–º–ø–æ—Ä—Ç–∏—Ä—É–µ–º –±–∏–±–ª–∏–æ—Ç–µ–∫–∏
import pandas as pd
from sqlalchemy import create_engine
# —É—Å—Ç–∞–Ω–∞–≤–ª–∏–≤–∞–µ–º –ø–∞—Ä–∞–º–µ—Ç—Ä—ã
db_config = {'user': 'praktikum_student', # –∏–º—è –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è
'pwd': 'Sdf4$2;d-d30pp', # –ø–∞—Ä–æ–ª—å
'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
'port': 6432, # –ø–æ—Ä—Ç –ø–æ–¥–∫–ª—é—á–µ–Ω–∏—è
'db': 'data-analyst-final-project-db'} # –Ω–∞–∑–≤–∞–Ω–∏–µ –±–∞–∑—ã –¥–∞–Ω–Ω—ã—Ö
connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'], db_config['pwd'], db_config['host'], db_config['port'],
db_config['db']) 
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

### –ü—Ä–æ—Å–º–æ—Ç—Ä —Ç–∞–±–ª–∏—Ü

In [2]:
query_b = ''' SELECT *
            FROM books
            LIMIT 5
        '''

In [3]:
books = pd.io.sql.read_sql(query_b, con = engine)

In [4]:
books

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

In [5]:
query_a = ''' SELECT *
            FROM authors
            LIMIT 5
        '''

In [6]:
authors = pd.io.sql.read_sql(query_a, con = engine)

In [7]:
authors

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

In [8]:
query_p = ''' SELECT *
            FROM publishers
            LIMIT 5
        '''

In [9]:
publishers = pd.io.sql.read_sql(query_p, con = engine)

In [10]:
publishers

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

In [11]:
query_r = ''' SELECT *
            FROM ratings
            LIMIT 5
        '''

In [12]:
ratings = pd.io.sql.read_sql(query_r, con = engine)

In [13]:
ratings

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

In [14]:
query_rv = ''' SELECT *
            FROM reviews
            LIMIT 5
        '''

In [15]:
reviews = pd.io.sql.read_sql(query_rv, con = engine)

In [16]:
reviews

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

<div class="alert alert-block alert-success">
    

### –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π –æ—Ç —Ä–µ–≤—å—é–µ—Ä–∞
–û—Ç–ª–∏—á–Ω–æ
    
–î–æ—Å—Ç—É–ø –∫ –±–∞–∑–µ –ø–æ–ª—É—á–∏–ª–∏, –Ω–∞ —Ç–∞–±–ª–∏—Ü—ã –ø–æ—Å–º–æ—Ç—Ä–µ–ª–∏, –ø–µ—Ä–µ—Ö–æ–¥–∏–º –∫ –æ—Å–Ω–æ–≤–Ω–æ–π —Ä–∞–±–æ—Ç–µ
    
</div>

### –ó–∞–¥–∞–Ω–∏–µ 1. –ü–æ—Å—á–∏—Ç–∞–π—Ç–µ, —Å–∫–æ–ª—å–∫–æ –∫–Ω–∏–≥ –≤—ã—à–ª–æ –ø–æ—Å–ª–µ 1 —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞

In [17]:
query1 = ''' SELECT COUNT(book_id)
            FROM books
            WHERE DATE(publication_date) > '2000-1-1'
        '''

In [18]:
books_cnt = pd.io.sql.read_sql(query1, con = engine)

In [19]:
books_cnt

   count
0    819

–ü–æ—Å–ª–µ 1 —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞ –≤—ã–ø—É—â–µ–Ω–æ 819 –∫–Ω–∏–≥

<div class="alert alert-block alert-success">
 

### –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π –æ—Ç —Ä–µ–≤—å—é–µ—Ä–∞ v_1

    
üëçüèª
</div>

### –ó–∞–¥–∞–Ω–∏–µ 2. –î–ª—è –∫–∞–∂–¥–æ–π –∫–Ω–∏–≥–∏ –ø–æ—Å—á–∏—Ç–∞–π—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –∏ —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É

In [41]:
query2 = ''' 

SELECT b.title AS book_name,
       b.book_id AS id,
       rv.n_rev AS reviews,
       r.avg_rat AS avg_rating
FROM books as b LEFT JOIN 
                (SELECT
                    book_id,
                    AVG(rating) AS avg_rat
                FROM
                    ratings
                GROUP BY 
                    book_id
                ) AS r ON r.book_id = b.book_id
        LEFT JOIN
                (SELECT 
                    book_id,
                    COUNT(review_id) AS n_rev
                FROM
                    reviews
                GROUP BY 
                    book_id
                ) AS rv ON rv.book_id = b.book_id
                
; '''

In [42]:
book_ratings_rewievs = pd.io.sql.read_sql(query2, con = engine)

In [43]:
book_ratings_rewievs

,book_name,id,reviews,avg_rating
0,The Body in the Library (Miss Marple #3),652,2.0,4.500000
1,Gal√°pagos,273,2.0,4.500000
2,A Tree Grows in Brooklyn,51,5.0,4.250000
3,Undaunted Courage: The Pioneering First Missio...,951,2.0,4.000000
4,The Prophet,839,4.0,4.285714
...,...,...,...,...
995,Alice in Wonderland,64,4.0,4.230769
996,A Woman of Substance (Emma Harte Saga #1),55,2.0,5.000000
997,Christine,148,3.0,3.428571
998,The Magicians' Guild (Black Magician Trilogy #1),790,2.0,3.500000
999,The Plot Against America,828,2.0,3.000000

–í—ã–≤–µ–ª –¥–∞–Ω–Ω—ã–µ –ø–æ –æ—Ü–µ–Ω–∫–∞–º –∏ –æ–±–∑–æ—Ä–∞–º –¥–ª—è –≤—Å–µ—Ö –∫–Ω–∏–≥

<div class="alert alert-block alert-success">
 

### –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π –æ—Ç —Ä–µ–≤—å—é–µ—Ä–∞ v_1

üëçüèª
    

–ú–æ–∂–Ω–æ –æ–±–æ–π—Ç–∏—Å—å –±–µ–∑ –ø–æ–¥–∑–∞–ø—Ä–æ—Å–æ–≤ –∏ –ø—Ä–∏–¥–∂–æ–π–Ω–∏—Ç—å —Ç–∞–±–ª–∏—Ü—ã, –µ—Å–ª–∏ —Å—á–∏—Ç–∞—Ç—å –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã–º –æ–±–∑–æ—Ä–∞–º COUNT(DISTINCT review_id)
    
–ò –ø—Ä–æ–ø—É—Å–∫–∏ –≤ –∫–æ–ª–∏—á–µ—Å—Ç–≤–µ –æ–±–∑–æ—Ä–æ–≤ –ª—É—á—à–µ –∑–∞–º–µ–Ω–∏—Ç—å –Ω–∞ 0, –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å —Å –ø–æ–º–æ—â—å—é COALESCE
    
</div>

### –ó–∞–¥–∞–Ω–∏–µ 3. –û–ø—Ä–µ–¥–µ–ª–∏—Ç–µ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ, –∫–æ—Ç–æ—Ä–æ–µ –≤—ã–ø—É—Å—Ç–∏–ª–æ –Ω–∞–∏–±–æ–ª—å—à–µ–µ —á–∏—Å–ª–æ –∫–Ω–∏–≥ —Ç–æ–ª—â–µ 50 —Å—Ç—Ä–∞–Ω–∏—Ü ‚Äî —Ç–∞–∫ –≤—ã –∏—Å–∫–ª—é—á–∏—Ç–µ –∏–∑ –∞–Ω–∞–ª–∏–∑–∞ –±—Ä–æ—à—é—Ä—ã

In [23]:
query3 = ''' 
SELECT bp.publisher_id,
       bp.publisher,
       bp.n_books
FROM
    (SELECT 
        b.publisher_id AS publisher_id,
        COUNT(b.book_id) AS n_books,
        p.publisher AS publisher 
    FROM 
        books as b
        LEFT JOIN publishers as p ON b.publisher_id=p.publisher_id

    WHERE 
        num_pages>50
    GROUP BY
        b.publisher_id,
        p.publisher
    ORDER BY 
        n_books DESC) AS bp
LIMIT 1
; '''

In [24]:
best_publisher = pd.io.sql.read_sql(query3, con = engine)

In [25]:
best_publisher

   publisher_id      publisher  n_books
0           212  Penguin Books       42

–ë—ã–ª—å—à–µ –≤—Å–µ–≥–æ –∫–Ω–∏–≥ –≤—ã–ø—É—Å—Ç–∏–ª–æ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ Penguin Books, 42 –∫–Ω–∏–≥–∏

<div class="alert alert-block alert-success">
 

### –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π –æ—Ç —Ä–µ–≤—å—é–µ—Ä–∞ v_1

üëçüèª
    
</div>

### –ó–∞–¥–∞–Ω–∏–µ 4. –û–ø—Ä–µ–¥–µ–ª–∏—Ç–µ –∞–≤—Ç–æ—Ä–∞ —Å —Å–∞–º–æ–π –≤—ã—Å–æ–∫–æ–π —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π –∫–Ω–∏–≥ ‚Äî —É—á–∏—Ç—ã–≤–∞–π—Ç–µ —Ç–æ–ª—å–∫–æ –∫–Ω–∏–≥–∏ —Å 50 –∏ –±–æ–ª–µ–µ –æ—Ü–µ–Ω–∫–∞–º–∏

In [35]:
query4 = ''' 
SELECT a_avg.author,
       AVG(a_avg.avg_rating) AS avg_avg_rating
FROM
        (SELECT 
            a.author AS author,
            AVG(r.rating) AS avg_rating
        FROM books as b
            LEFT JOIN authors as a ON b.author_id = a.author_id
            LEFT JOIN ratings as r ON b.book_id = r.book_id
        GROUP BY 
             b.book_id,
             a.author_id
        HAVING
            COUNT(r.rating_id) >=50 
        ) AS a_avg 
GROUP BY a_avg.author
ORDER BY avg_avg_rating DESC
LIMIT 5
    
; '''

In [36]:
best_author = pd.io.sql.read_sql(query4, con = engine)

In [37]:
best_author

                              author  avg_avg_rating
0         J.K. Rowling/Mary GrandPr√©        4.283844
1  Markus Zusak/Cao Xu√¢n Vi·ªát Kh∆∞∆°ng        4.264151
2                     J.R.R. Tolkien        4.258446
3                  Louisa May Alcott        4.192308
4                       Rick Riordan        4.080645

–õ—É—á—à–∏–º –∞–≤—Ç–æ—Ä–æ–º —Å —Å–∞–º–æ–π –≤—ã—Å–æ–∫–æ–π —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π –∫–Ω–∏–≥ —è–≤–ª—è–µ—Ç—Å—è J.K. Rowling/Mary GrandPr√©

<div class="alert alert-block alert-success">
 

### –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π –æ—Ç —Ä–µ–≤—å—é–µ—Ä–∞ v_1

üëçüèª
    
–ó–¥–µ—Å—å —á–∞—Å—Ç–µ–Ω—å–∫–æ –æ—à–∏–±–∞—é—Ç—Å—è, –º–æ–ª–æ–¥–µ—Ü, —á—Ç–æ —Å—á–∏—Ç–∞–µ—à—å –∏–º–µ–Ω–Ω–æ –∫–Ω–∏–≥–∏ —Å 50-—é –∏ –±–æ–ª–µ–µ –æ—Ü–µ–Ω–∫–∞–º–∏
    
</div>

### –ó–∞–¥–∞–Ω–∏–µ 5. –ü–æ—Å—á–∏—Ç–∞–π—Ç–µ —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –æ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 50 –æ—Ü–µ–Ω–æ–∫

In [29]:
query5 = ''' 

SELECT
    AVG(mean_rewievs.n_reviews)
FROM
    (SELECT
        username,
        COUNT(review_id) AS n_reviews
    FROM
        reviews
    WHERE 
        username IN (
                SELECT 
                    username
                FROM 
                    ratings
                GROUP BY 
                    username
                HAVING 
                    COUNT(rating_id) > 50
                    )
    GROUP BY 
        username
    ) AS mean_rewievs
; '''

In [30]:
mean_rewievs = pd.io.sql.read_sql(query5, con = engine)

In [31]:
mean_rewievs

         avg
0  24.333333

–°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –æ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π —Å–æ—Å—Ç–∞–≤–∏–ª–æ 24.3

<div class="alert alert-block alert-success">
 

### –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π –æ—Ç —Ä–µ–≤—å—é–µ—Ä–∞ v_1

üëçüèª
      
</div>

<div class="alert alert-block alert-warning">

### –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π –æ—Ç —Ä–µ–≤—å—é–µ—Ä–∞ v_1
–†–µ–∫–æ–º–µ–Ω–¥–∞—Ü–∏—è

–†–∞–±–æ—Ç—É —Å–ª–µ–¥—É–µ—Ç –ø–æ–¥—ã—Ç–æ–∂–∏—Ç—å –æ–±—â–∏–º –≤—ã–≤–æ–¥–æ–º
</div>